package com.it.demo2;

import java.util.Scanner;

public class demo6 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int a = sc.nextInt();
        double b = a - a * 10 / 100;
        if(b < 5000){
            System.out.println("纳税数额" + 0);
            System.out.println("纳后工资" + b);
        } else if (b >= 5000 && b < 8000) {
            System.out.println("纳税数额" + (b - 5000) * 3 / 100);
            System.out.println("纳后工资" + (b - (b - 5000) * 3 / 100));
        } else if (b >= 8000 && b < 17000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + (b - 8000) * 10 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - (b - 8000) * 10 / 100));
        } else if (b >= 17000 && b < 30000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + 9000 * 10 / 100 + (b - 17000) * 20 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - 9000 * 10 / 100 - (b - 17000) * 20 / 100));
        } else if (b >= 30000 && b < 40000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + 9000 * 10 / 100 + 13000 * 20 / 100 + (b - 30000) * 25 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - 9000 * 10 / 100 - 13000 * 20 / 100 - (b - 30000) * 25 / 100));
        } else if (b >= 40000 && b < 60000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + 9000 * 10 / 100 + 13000 * 20 / 100 + 10000 * 25 / 100 + (b - 40000) * 30 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - 9000 * 10 / 100 - 13000 * 20 / 100 - 10000 * 25 / 100 - (b - 40000) * 30 / 100));
        } else if (b >= 60000 && b < 85000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + 9000 * 10 / 100 + 13000 * 20 / 100 + 10000 * 25 / 100 + 20000 * 30 / 100 + (b - 60000) * 35 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - 9000 * 10 / 100 - 13000 * 20 / 100 - 10000 * 25 / 100 - 20000 * 30 / 100 - (b - 60000) * 35 / 100));
        }else if(b >= 85000) {
            System.out.println("纳税数额" + (3000 * 3 / 100 + 9000 * 10 / 100 + 13000 * 20 / 100 + 10000 * 25 / 100 + 20000 * 30 / 100 + 25000 * 35 / 100 + (b - 85000) * 40 / 100));
            System.out.println("纳后工资" + (b - 3000 * 3 / 100 - 9000 * 10 / 100 - 13000 * 20 / 100 - 10000 * 25 / 100 - 20000 * 30 / 100 - 25000 * 35 / 100 - (b - 85000) * 40 / 100));
        }
    }
    }

